[Killed] BlockStatement
src/components/PostDetails/index.tsx:8:27
 import Message from '../Message'
 import Loading from '../Loading'
 
-const PostDetails = () => {
-  const {id} = useParams()
-
-  const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => getPostById(id!)})
-
-  if(isLoading)
-    return <Loading />
-
-  return (
-    <>
-      {post && (
-        <div className={styles.post_details}>
-          <img src={post.imageURL} alt={post.title} />
-          <h2>{post.title}</h2>
-          <p>{post.description}</p>
-        </div>
-      )}
-      {error && <Message msg={error.message} typeMsg='error' />}
-    </>
-  )
-}
+const PostDetails = () => {}
 
 export default PostDetails
killedBy: PostDetails Component should render PostDetails correctly
statusReason: Error: Unable to find role="img"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/PostDetails/index.tsx:11:88
 const PostDetails = () => {
   const {id} = useParams()
 
-  const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => getPostById(id!)})
+  const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => undefined})
 
   if(isLoading)
killedBy: PostDetails Component should call useQuery with {queryKey: ['post/getOne'], queryFn: () => getPostById(id!)} params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrayDeclaration
src/components/PostDetails/index.tsx:11:62
 const PostDetails = () => {
   const {id} = useParams()
 
-  const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => getPostById(id!)})
+  const {data: post, error, isLoading} = useQuery({queryKey: [], queryFn: () => getPostById(id!)})
 
   if(isLoading)
killedBy: PostDetails Component should call useQuery with {queryKey: ['post/getOne'], queryFn: () => getPostById(id!)} params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"queryFn": Any<Function>, "queryKey": ["post/getOne"]}
Received: {"queryFn": [Function anonymous], "queryKey": []}

Number of calls: 1

[Killed] ConditionalExpression
src/components/PostDetails/index.tsx:13:6
 
   const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => getPostById(id!)})
 
-  if(isLoading)
+  if(true)
     return <Loading />
 
killedBy: PostDetails Component should render PostDetails correctly
statusReason: Error: Unable to find an element with the text: Post 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="loading"
      data-testid="loading"

[Killed] ConditionalExpression
src/components/PostDetails/index.tsx:13:6
 
   const {data: post, error, isLoading} = useQuery({queryKey: ['post/getOne'], queryFn: () => getPostById(id!)})
 
-  if(isLoading)
+  if(false)
     return <Loading />
 
killedBy: PostDetails Component should render a loading message
statusReason: Error: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/components/PostDetails/index.tsx:18:8
 
   return (
     <>
-      {post && (
-        <div className={styles.post_details}>
-          <img src={post.imageURL} alt={post.title} />
-          <h2>{post.title}</h2>
-          <p>{post.description}</p>
-        </div>
-      )}
+      {true}
       {error && <Message msg={error.message} typeMsg='error' />}
     </>
killedBy: PostDetails Component should render PostDetails correctly
statusReason: Error: Unable to find role="img"

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/components/PostDetails/index.tsx:18:8
 
   return (
     <>
-      {post && (
-        <div className={styles.post_details}>
-          <img src={post.imageURL} alt={post.title} />
-          <h2>{post.title}</h2>
-          <p>{post.description}</p>
-        </div>
-      )}
+      {post || <div className={styles.post_details}>
+          <img src={post.imageURL} alt={post.title} />
+          <h2>{post.title}</h2>
+          <p>{post.description}</p>
+        </div>}
       {error && <Message msg={error.message} typeMsg='error' />}
     </>
killedBy: PostDetails Component should render PostDetails correctly
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, title, description, imageURL}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/components/PostDetails/index.tsx:25:8
           <p>{post.description}</p>
         </div>
       )}
-      {error && <Message msg={error.message} typeMsg='error' />}
+      {true}
     </>
   )
killedBy: PostDetails Component should render an error message
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] LogicalOperator
src/components/PostDetails/index.tsx:25:8
           <p>{post.description}</p>
         </div>
       )}
-      {error && <Message msg={error.message} typeMsg='error' />}
+      {error || <Message msg={error.message} typeMsg='error' />}
     </>
   )
killedBy: PostDetails Component should render PostDetails correctly
statusReason: TypeError: Cannot read properties of null (reading 'message')
