[Killed] BlockStatement
src/App.tsx:9:17
 import About from './pages/About'
 import CreatePost from './pages/CreatePost'
 
-function App () {
-  return (
-    
-      <BrowserRouter>
-        <Navbar/>
-        <div data-testid='container' className='container'>
-          <Routes>
-            <Route path='/' element={<Home/>}/>
-            <Route path='/about' element={<About />}/>
-            <Route path='/posts/create' element={<CreatePost />} />
-            <Route path='/posts/:id' element={<PostDetails />} />
-          </Routes>
-        </div>
-        <Footer/>
-      </BrowserRouter>
-  )
-}
+function App () {}
 
 export default App
killedBy: App Should render container, navbar and footer correctly
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="container"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
