[Killed] BlockStatement
src/components/Post/index.tsx:9:37
   post: IPost
 }
 
-const Post = ({post}: PostProps) => {
-  return (
-    <div className={styles.post}>
-      <img src={post.imageURL} alt={post.title} />
-      <h2>{post.title}</h2>
-      <Link className='btn' to={`/posts/${post.id}`}>Ver mais</Link>
-    </div>
-  )
-}
+const Post = ({post}: PostProps) => {}
 
 export default Post
killedBy: Post Component should render Post correctly
statusReason: Error: Unable to find role="img"

Ignored nodes: comments, script, style
<body>
  <div />
</body>
