[Killed] BlockStatement
src/components/Footer/index.tsx:3:22
 import styles from './Footer.module.css'
 
-const Footer = () => {
-  return (
-    <footer className={styles.footer}>
-      <p>Todos os direitos reservados</p>
-      <p>&copy; Simple<b>Gram</b>, 2024</p>
-    </footer>
-  )
-}
+const Footer = () => {}
 
 export default Footer
killedBy: App Should render container, navbar and footer correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Todos os direitos reservados. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar"
    >
