[Timeout] BlockStatement
src/components/Message/index.tsx:6:51
   typeMsg: 'error' | 'success'
 }
 
-const Message = ({msg, typeMsg}: MessageProps) => {
-  return (
-    <div data-testid="message" className={'message ' + typeMsg}>
-      <p>{msg}</p>
-    </div>
-  )
-}
+const Message = ({msg, typeMsg}: MessageProps) => {}
 
 export default Message
