[Killed] BlockStatement
src/components/Input/index.tsx:10:102
 } & ComponentPropsWithoutRef<'input'>
 
 
-const Input = forwardRef(({id, label, ...props}: InputProps, ref: ForwardedRef<HTMLInputElement>) => {
-  return (
-    <div className={styles.form_group}>
-      <label htmlFor={id}>{label}:</label>
-      <input id={id} {...props} ref={ref}/>
-    </div>
-  )
-})
+const Input = forwardRef(({id, label, ...props}: InputProps, ref: ForwardedRef<HTMLInputElement>) => {})
 
 export default Input
killedBy: CreatePost Page should render all form inputs and submit button
statusReason: Error: Unable to find a label with the text of: Título:

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >
