[Killed] ObjectLiteral
src/pages/CreatePost/index.tsx:22:50
   const navigate = useNavigate()
 
   const query = useQueryClient()
-  const {mutate, isPending, error} = useMutation({
-    mutationFn: savePost,
-    onSuccess: () => {
-      query.invalidateQueries({queryKey: ['posts/getAll', 'post/getOne']})      
-      navigate("/")
-    }
-  
-  })
+  const {mutate, isPending, error} = useMutation({})
 
   const handleSubmit = (e: FormEvent) => {
killedBy: CreatePost Page should call useMutation with params: {mutationFn: savePost, onSuccess: () => query.invalidateQueries({queryKey: ['posts/getAll']})}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"mutationFn": Any<Function>, "onSuccess": Any<Function>}
Received: {}

Number of calls: 1

[Killed] BlockStatement
src/pages/CreatePost/index.tsx:24:22
   const query = useQueryClient()
   const {mutate, isPending, error} = useMutation({
     mutationFn: savePost,
-    onSuccess: () => {
-      query.invalidateQueries({queryKey: ['posts/getAll', 'post/getOne']})      
-      navigate("/")
-    }
+    onSuccess: () => {}
   
   })
killedBy: CreatePost Page should call useMutation with params: {mutationFn: savePost, onSuccess: () => query.invalidateQueries({queryKey: ['posts/getAll']})}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"queryKey": ["posts/getAll", "post/getOne"]}

Number of calls: 0

[Killed] BlockStatement
src/pages/CreatePost/index.tsx:34:9
   const handleSubmit = (e: FormEvent) => {
     e.preventDefault()
 
-    try {
-      new URL(imageUrlRef.current!.value)
-      
-      const newPost: IPost = {
-        title: titleRef.current!.value,
-        description: descriptionRef.current!.value,
-        imageURL: imageUrlRef.current!.value
-      }
-
-      mutate(newPost)
-      titleRef.current!.value = '' 
-      descriptionRef.current!.value = '' 
-      imageUrlRef.current!.value = ''
-      
-    // eslint-disable-next-line @typescript-eslint/no-unused-vars
-    } catch (err) {
+    try {} catch (err) {
       setUrlError("URL de imagem inválida")
       setTimeout(() => {
killedBy: CreatePost Page should call mutate function when form is submitted with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Description of Post 1", "imageURL": "https://www.cnnbrasil.com.br/wp-content/uploads/sites/12/Reuters_Direct_Media/BrazilOnlineReportSportsNews/tagreuters.com2023binary_LYNXMPEJ5B0PM-FILEDIMAGE-e1697726921338.jpg?w=420&h=240&crop=1&quality=85", "title": "Post 1"}

Number of calls: 0

Ignored nodes: comments, scr

[Killed] BlockStatement
src/pages/CreatePost/index.tsx:49:19
       imageUrlRef.current!.value = ''
       
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
-    } catch (err) {
-      setUrlError("URL de imagem inválida")
-      setTimeout(() => {
-        setUrlError(null)
-      }, 2000)
-    }
+    } catch (err) {}
 
 
killedBy: CreatePost Page should display error message for invalid image URL
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] StringLiteral
src/pages/CreatePost/index.tsx:50:19
       
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
     } catch (err) {
-      setUrlError("URL de imagem inválida")
+      setUrlError("")
       setTimeout(() => {
         setUrlError(null)
killedBy: CreatePost Page should display error message for invalid image URL
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] BlockStatement
src/pages/CreatePost/index.tsx:51:24
     // eslint-disable-next-line @typescript-eslint/no-unused-vars
     } catch (err) {
       setUrlError("URL de imagem inválida")
-      setTimeout(() => {
-        setUrlError(null)
-      }, 2000)
+      setTimeout(() => {}, 2000)
     }
 
killedBy: CreatePost Page should clear error messages after 2 seconds
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="message error" data-testid="message"><p>URL de imagem inválida</p></div> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] StringLiteral
src/pages/CreatePost/index.tsx:91:86
           type='text'
           maxLength={1000}
         />
-        <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
+        <input className="btn" disabled={isPending} type="submit" value={isPending ? "" : 'Postar'} />
         {urlError && <Message msg={urlError} typeMsg='error' />}
         {error && <Message msg={error.message} typeMsg='error' />}
killedBy: CreatePost Page should disable the submit button and show loading while the mutation is pending
statusReason: TestingLibraryElementError: Unable to find an element with the display value: Aguarde.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] ConditionalExpression
src/pages/CreatePost/index.tsx:92:10
           maxLength={1000}
         />
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
-        {urlError && <Message msg={urlError} typeMsg='error' />}
+        {false}
         {error && <Message msg={error.message} typeMsg='error' />}
         {isPending && <Loading/>}
killedBy: CreatePost Page should display error message for invalid image URL
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] LogicalOperator
src/pages/CreatePost/index.tsx:92:10
           maxLength={1000}
         />
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
-        {urlError && <Message msg={urlError} typeMsg='error' />}
+        {urlError || <Message msg={urlError} typeMsg='error' />}
         {error && <Message msg={error.message} typeMsg='error' />}
         {isPending && <Loading/>}
killedBy: CreatePost Page should display error message for invalid image URL
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] ConditionalExpression
src/pages/CreatePost/index.tsx:93:10
         />
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
         {urlError && <Message msg={urlError} typeMsg='error' />}
-        {error && <Message msg={error.message} typeMsg='error' />}
+        {false}
         {isPending && <Loading/>}
       </form>
killedBy: CreatePost Page should show error message when there is an error at useMutation returns
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] LogicalOperator
src/pages/CreatePost/index.tsx:93:10
         />
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
         {urlError && <Message msg={urlError} typeMsg='error' />}
-        {error && <Message msg={error.message} typeMsg='error' />}
+        {error || <Message msg={error.message} typeMsg='error' />}
         {isPending && <Loading/>}
       </form>
killedBy: CreatePost Page should render create post correctly
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Killed] ConditionalExpression
src/pages/CreatePost/index.tsx:94:10
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
         {urlError && <Message msg={urlError} typeMsg='error' />}
         {error && <Message msg={error.message} typeMsg='error' />}
-        {isPending && <Loading/>}
+        {true}
       </form>
     
killedBy: CreatePost Page should disable the submit button and show loading while the mutation is pending
statusReason: Error: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] ConditionalExpression
src/pages/CreatePost/index.tsx:94:10
         <input className="btn" disabled={isPending} type="submit" value={isPending ? 'Aguarde' : 'Postar'} />
         {urlError && <Message msg={urlError} typeMsg='error' />}
         {error && <Message msg={error.message} typeMsg='error' />}
-        {isPending && <Loading/>}
+        {false}
       </form>
     
killedBy: CreatePost Page should disable the submit button and show loading while the mutation is pending
statusReason: Error: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >
