[Timeout] BlockStatement
src/components/Loading/index.tsx:4:23
 import styles from './Loading.module.css'
 import loading from '../../assets/loading.svg'
 
-const Loading = () => {
-  return (
-    <div className={styles.loading} data-testid="loading">
-      <img src={loading} alt="loading screen" className={styles.loader}/>
-    </div>
-  )
-}
+const Loading = () => {}
 
 export default Loading
