[Killed] BlockStatement
src/components/Section/index.tsx:9:54
   children: ReactNode 
 }
 
-const Section = ({title, children}: SectionProps) => {
-  return (
-    <div className={styles.section}>
-      <h2>{title}</h2>
-      <p>{children}</p>
-    </div>
-  )
-}
+const Section = ({title, children}: SectionProps) => {}
 
 export default Section
killedBy: CreatePost Page should render create post correctly
statusReason: Error: Unable to find an element with the text: Crie seu post. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >
