[Killed] BlockStatement
src/pages/Home/index.tsx:10:20
 import Loading from '../../components/Loading'
 
 
-const Home = () => {
-  const {data: posts, error, isLoading} = useQuery({queryKey: ['posts/getAll'], queryFn: getPosts})
-  if(isLoading)
-    return <Loading />
-  return (
-    <div className={styles.home}>
-      <h2><IoIosHome/> Veja os melhores posts dos mais diversos assuntos</h2>
-      {error && <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error'/>}
-      <div className={styles.posts}>
-        {posts && posts.map(post => (
-          <Post data-testid="post" post={post} key={post.id}/>
-        ))}
-      </div>
-    </div>
-  )
-}
+const Home = () => {}
 
 export default Home
killedBy: Home Component Should render a loading message
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/pages/Home/index.tsx:11:64
 
 
 const Home = () => {
-  const {data: posts, error, isLoading} = useQuery({queryKey: ['posts/getAll'], queryFn: getPosts})
+  const {data: posts, error, isLoading} = useQuery({queryKey: [""], queryFn: getPosts})
   if(isLoading)
     return <Loading />
killedBy: Home Component should call useQuery with params: {queryKey: ['posts/getAll'], queryFn: getPosts}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"queryFn": Any<Function>, "queryKey": ["posts/getAll"]}
Received: {"queryFn": [Function mockConstructor], "queryKey": [""]}

Number of calls: 1

[Killed] ArrayDeclaration
src/pages/Home/index.tsx:11:63
 
 
 const Home = () => {
-  const {data: posts, error, isLoading} = useQuery({queryKey: ['posts/getAll'], queryFn: getPosts})
+  const {data: posts, error, isLoading} = useQuery({queryKey: [], queryFn: getPosts})
   if(isLoading)
     return <Loading />
killedBy: Home Component should call useQuery with params: {queryKey: ['posts/getAll'], queryFn: getPosts}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"queryFn": Any<Function>, "queryKey": ["posts/getAll"]}
Received: {"queryFn": [Function mockConstructor], "queryKey": []}

Number of calls: 1

[Killed] ConditionalExpression
src/pages/Home/index.tsx:12:6
 
 const Home = () => {
   const {data: posts, error, isLoading} = useQuery({queryKey: ['posts/getAll'], queryFn: getPosts})
-  if(isLoading)
+  if(false)
     return <Loading />
   return (
killedBy: Home Component Should render a loading message
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home"
    >

[Killed] ConditionalExpression
src/pages/Home/index.tsx:12:6
 
 const Home = () => {
   const {data: posts, error, isLoading} = useQuery({queryKey: ['posts/getAll'], queryFn: getPosts})
-  if(isLoading)
+  if(true)
     return <Loading />
   return (
killedBy: Home Component Should render a error message
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="loading"
      data-testid="loading"

[Killed] ConditionalExpression
src/pages/Home/index.tsx:17:8
   return (
     <div className={styles.home}>
       <h2><IoIosHome/> Veja os melhores posts dos mais diversos assuntos</h2>
-      {error && <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error'/>}
+      {false}
       <div className={styles.posts}>
         {posts && posts.map(post => (
killedBy: Home Component Should render a error message
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home"
    >

[Killed] LogicalOperator
src/pages/Home/index.tsx:17:8
   return (
     <div className={styles.home}>
       <h2><IoIosHome/> Veja os melhores posts dos mais diversos assuntos</h2>
-      {error && <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error'/>}
+      {error || <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error' />}
       <div className={styles.posts}>
         {posts && posts.map(post => (
killedBy: Home Component Should render a error message
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home"
    >

[Killed] ArrowFunction
src/pages/Home/index.tsx:19:29
       <h2><IoIosHome/> Veja os melhores posts dos mais diversos assuntos</h2>
       {error && <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error'/>}
       <div className={styles.posts}>
-        {posts && posts.map(post => (
-          <Post data-testid="post" post={post} key={post.id}/>
-        ))}
+        {posts && posts.map(() => undefined)}
       </div>
     </div>
killedBy: Home Component should render posts
statusReason: TestingLibraryElementError: Unable to find an element with the text: Post 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="home"
    >

[Killed] LogicalOperator
src/pages/Home/index.tsx:19:10
       <h2><IoIosHome/> Veja os melhores posts dos mais diversos assuntos</h2>
       {error && <Message msg='Um erro ocorreu ao carregar os posts! Tente novamente mais tarde' typeMsg='error'/>}
       <div className={styles.posts}>
-        {posts && posts.map(post => (
-          <Post data-testid="post" post={post} key={post.id}/>
-        ))}
+        {posts || posts.map(post => <Post data-testid="post" post={post} key={post.id} />)}
       </div>
     </div>
killedBy: Home Component Should render a error message
statusReason: TypeError: Cannot read properties of null (reading 'map')
