[Killed] LogicalOperator
src/components/Form/index.tsx:18:21
  
   return (
     <form onSubmit={handleSubmit(handleForm)}>
-      <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
+      <Input style={errors.title || {
+  borderBottomColor: '#c52722',
+  color: '#c52722'
+}}
           id='title' 
           label='Título' 
killedBy: Form Component should display nothing when type valid data
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] ConditionalExpression
src/components/Form/index.tsx:18:21
  
   return (
     <form onSubmit={handleSubmit(handleForm)}>
-      <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
+      <Input style={false}
           id='title' 
           label='Título' 
killedBy: Form Component should render Form component correclty
statusReason: Error: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.

[Killed] ObjectLiteral
src/components/Form/index.tsx:25:25
           type='text'
           {...register("title", 
             {required: "O título é obrigatório",
-             maxLength: {value: 100, message: "O título só pode ter no máximo 100 caracteres"}, 
+             maxLength: {}, 
              minLength: {value: 3, message: "O título precisa ter no mínimo 3 caracteres"}})}
         />
killedBy: Form Component should display max lenght error for title
statusReason: Error: Unable to find an element by: [data-testid="error_form"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form>
      <div
        class="form_group"

[Killed] ObjectLiteral
src/components/Form/index.tsx:26:25
           {...register("title", 
             {required: "O título é obrigatório",
              maxLength: {value: 100, message: "O título só pode ter no máximo 100 caracteres"}, 
-             minLength: {value: 3, message: "O título precisa ter no mínimo 3 caracteres"}})}
+             minLength: {}})}
         />
         {errors.title && <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
killedBy: Form Component should display min lenght error for title and description
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<span class="error_form" data-testid="error_form">A descrição precisa ter no mínimo 3 caracteres</span>]

[Killed] ConditionalExpression
src/components/Form/index.tsx:28:10
              maxLength: {value: 100, message: "O título só pode ter no máximo 100 caracteres"}, 
              minLength: {value: 3, message: "O título precisa ter no mínimo 3 caracteres"}})}
         />
-        {errors.title && <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
+        {false}
 
         <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O link da imagem é obrigatório</span>, <span class="error_form" data-testid="error_form">A descrição é obrigatória</span>]

[Killed] LogicalOperator
src/components/Form/index.tsx:28:10
              maxLength: {value: 100, message: "O título só pode ter no máximo 100 caracteres"}, 
              minLength: {value: 3, message: "O título precisa ter no mínimo 3 caracteres"}})}
         />
-        {errors.title && <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
+        {errors.title || <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
 
         <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
killedBy: Form Component should render Form component correclty
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/components/Form/index.tsx:30:23
         />
         {errors.title && <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
 
-        <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
+        <Input style={true}
           id='imageUrl' 
           label='Link da imagem' 
killedBy: Form Component should render Form component correclty
statusReason: Error: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.

[Killed] ConditionalExpression
src/components/Form/index.tsx:30:23
         />
         {errors.title && <span data-testid="error_form" className={styles.error_form}>{errors.title.message}</span>}
 
-        <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
+        <Input style={false}
           id='imageUrl' 
           label='Link da imagem' 
killedBy: Form Component should render Form component correclty
statusReason: Error: The `style` prop expects a mapping from style properties to values, not a string. For example, style={{marginRight: spacing + 'em'}} when using JSX.

[Killed] ObjectLiteral
src/components/Form/index.tsx:35:36
           label='Link da imagem' 
           placeholder='Link da imagem do seu post...' 
           type='text'
-          {...register("imageURL", {required: "O link da imagem é obrigatório",
-            validate: isImageLink
-          })}
+          {...register("imageURL", {})}
         />
         {errors.imageURL && <span data-testid="error_form" className={styles.error_form}>{errors.imageURL.message}</span>}
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O título é obrigatório</span>, <span class="error_form" data-testid="error_form">A descrição é obrigatória</span>]

[Killed] ConditionalExpression
src/components/Form/index.tsx:39:10
             validate: isImageLink
           })}
         />
-        {errors.imageURL && <span data-testid="error_form" className={styles.error_form}>{errors.imageURL.message}</span>}
+        {false}
 
         <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O título é obrigatório</span>, <span class="error_form" data-testid="error_form">A descrição é obrigatória</span>]

[Killed] LogicalOperator
src/components/Form/index.tsx:39:10
             validate: isImageLink
           })}
         />
-        {errors.imageURL && <span data-testid="error_form" className={styles.error_form}>{errors.imageURL.message}</span>}
+        {errors.imageURL || <span data-testid="error_form" className={styles.error_form}>{errors.imageURL.message}</span>}
 
         <Input style={errors.title && {borderBottomColor: '#c52722', color: '#c52722'}}
killedBy: Form Component should render Form component correclty
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
src/components/Form/index.tsx:46:50
           label='Descrição' 
           placeholder='Descrição do seu post...' 
           type='text'
-          {...register("description", {required: "A descrição é obrigatória",
+          {...register("description", {required: "",
             minLength: {value: 3, message: "A descrição precisa ter no mínimo 3 caracteres"}
           })}
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O título é obrigatório</span>, <span class="error_form" data-testid="error_form">O link da imagem é obrigatório</span>]

[Killed] ObjectLiteral
src/components/Form/index.tsx:46:39
           label='Descrição' 
           placeholder='Descrição do seu post...' 
           type='text'
-          {...register("description", {required: "A descrição é obrigatória",
-            minLength: {value: 3, message: "A descrição precisa ter no mínimo 3 caracteres"}
-          })}
+          {...register("description", {})}
         />
         {errors.description && <span data-testid="error_form" className={styles.error_form}>{errors.description.message}</span>}
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O título é obrigatório</span>, <span class="error_form" data-testid="error_form">O link da imagem é obrigatório</span>]

[Killed] LogicalOperator
src/components/Form/index.tsx:50:10
             minLength: {value: 3, message: "A descrição precisa ter no mínimo 3 caracteres"}
           })}
         />
-        {errors.description && <span data-testid="error_form" className={styles.error_form}>{errors.description.message}</span>}
+        {errors.description || <span data-testid="error_form" className={styles.error_form}>{errors.description.message}</span>}
         
 
killedBy: Form Component should render Form component correclty
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
src/components/Form/index.tsx:50:10
             minLength: {value: 3, message: "A descrição precisa ter no mínimo 3 caracteres"}
           })}
         />
-        {errors.description && <span data-testid="error_form" className={styles.error_form}>{errors.description.message}</span>}
+        {false}
         
 
killedBy: Form Component should show error messages when type invalid data
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 3
Received length: 2
Received array:  [<span class="error_form" data-testid="error_form">O título é obrigatório</span>, <span class="error_form" data-testid="error_form">O link da imagem é obrigatório</span>]
