[Killed] StringLiteral
src/pages/CreatePost/index.tsx:18:59
   const {mutate, isPending, error} = useMutation({
     mutationFn: savePost,
     onSuccess: () => {
-      query.invalidateQueries({queryKey: ['posts/getAll', 'post/getOne']})      
+      query.invalidateQueries({queryKey: ['posts/getAll', ""]})      
       navigate("/")
     }
killedBy: CreatePost Page should call useMutation with params: {mutationFn: savePost, onSuccess: () => query.invalidateQueries({queryKey: ['posts/getAll']})}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "queryKey": Array [
      "posts/getAll",

[Killed] StringLiteral
src/pages/CreatePost/index.tsx:18:43
   const {mutate, isPending, error} = useMutation({
     mutationFn: savePost,
     onSuccess: () => {
-      query.invalidateQueries({queryKey: ['posts/getAll', 'post/getOne']})      
+      query.invalidateQueries({queryKey: ["", 'post/getOne']})      
       navigate("/")
     }
killedBy: CreatePost Page should call useMutation with params: {mutationFn: savePost, onSuccess: () => query.invalidateQueries({queryKey: ['posts/getAll']})}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "queryKey": Array [
-     "posts/getAll",

[Killed] StringLiteral
src/pages/CreatePost/index.tsx:19:16
     mutationFn: savePost,
     onSuccess: () => {
       query.invalidateQueries({queryKey: ['posts/getAll', 'post/getOne']})      
-      navigate("/")
+      navigate("")
     }
   
killedBy: CreatePost Page should call useMutation with params: {mutationFn: savePost, onSuccess: () => query.invalidateQueries({queryKey: ['posts/getAll']})}
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/pages/CreatePost/index.tsx:24:41
   
   })
 
-  const handleSubmit = (data: IPost) => {
-    const newPost: IPost = {...data}
-
-    mutate(newPost)
-  }
+  const handleSubmit = (data: IPost) => {}
 
   return (
killedBy: CreatePost Page should call mutate function when form is submitted with valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"description": "Description of Post 1", "imageURL": "https://www.cnnbrasil.com.br/wp-content/uploads/sites/12/Reuters_Direct_Media/BrazilOnlineReportSportsNews/tagreuters.com2023binary_LYNXMPEJ5B0PM-FILEDIMAGE-e1697726921338.jpg", "title": "Post 1"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/pages/CreatePost/index.tsx:37:8
       </Section>
       <Form handleForm={handleSubmit} isPending={isPending} />
 
-      {error && <Message msg={error.message} typeMsg='error' />}
+      {false}
       {isPending && <Loading/>}
     
killedBy: CreatePost Page should show error message when there is an error at useMutation returns
statusReason: Error: Unable to find an element by: [data-testid="message"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="form"
    >

[Killed] LogicalOperator
src/pages/CreatePost/index.tsx:37:8
       </Section>
       <Form handleForm={handleSubmit} isPending={isPending} />
 
-      {error && <Message msg={error.message} typeMsg='error' />}
+      {error || <Message msg={error.message} typeMsg='error' />}
       {isPending && <Loading/>}
     
killedBy: CreatePost Page should render create post correctly
statusReason: TypeError: Cannot read properties of null (reading 'message')

[Killed] LogicalOperator
src/pages/CreatePost/index.tsx:38:8
       <Form handleForm={handleSubmit} isPending={isPending} />
 
       {error && <Message msg={error.message} typeMsg='error' />}
-      {isPending && <Loading/>}
+      {isPending || <Loading />}
     
     </div>
killedBy: CreatePost Page should not show loading when isPending is False
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="loading" data-testid="loading"><img alt="loading screen" class="loader" src="test-file-stub" /></div> instead
